BellerageHackathon/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <attributes>
    <name>ИдентификаторТеста</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпубликованнаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАрхивации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаАрхивации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/СтатусыТестов/СтатусыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/Тесты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторТеста) Тогда
		ИдентификаторТеста = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыТестов.Черновик;
	КонецЕсли;

	ДатаСоздания = ТекущаяДатаСеанса();
	ДатаПоследнегоИзменения = ДатаСоздания;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторТеста) Тогда
		ИдентификаторТеста = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыТестов.Черновик;
	КонецЕсли;

	Если ДатаСоздания = Дата(1, 1, 1) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаПоследнегоИзменения = ТекущаяДатаСеанса();

	Если ЗначениеЗаполнено(РабочаяВерсия)
		И РабочаяВерсия.Владелец <> Ссылка Тогда
		ВызватьИсключение "Рабочая версия принадлежит другому тесту.";
	КонецЕсли;

	Если ЗначениеЗаполнено(ОпубликованнаяВерсия)
		И ОпубликованнаяВерсия.Владелец <> Ссылка Тогда
		ВызватьИсключение "Опубликованная версия принадлежит другому тесту.";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Тесты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Тесты КАК Тесты
	|ГДЕ
	|	Тесты.ИдентификаторТеста = &ИдентификаторТеста
	|	И Тесты.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("ИдентификаторТеста", ИдентификаторТеста);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор теста уже используется.";
	КонецЕсли;

КонецПроцедуры
